app/Controllers/Artikel.php

public function add()
{
// validasi data.
$validation = \Config\Services::validation();
$validation->setRules(['judul' => 'required']);
$isDataValid = $validation->withRequest($this->request)->run();
if ($isDataValid)
{
$artikel = new ArtikelModel();
$artikel->insert([
'judul' => $this->request->getPost('judul'),
'isi' => $this->request->getPost('isi'),
'slug' => url_title($this->request->getPost('judul')),
]);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES ('Artikel Ketiga', 'Komandan Lapangan kegiatan Motocross Grand Prix (MXGP) Samota Sumbawa NTB Ridwan Syah menyampaikan bahwa logistik balapan internasional akan tiba di Bandara Internasional Lombok, pada 18 Juni 2022.', 'Artikel-Ketiga')